examples/c/vm_files/fio_output.log
hotspot: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.36
Starting 32 processes

hotspot: (groupid=0, jobs=32): err= 0: pid=248007: Thu Dec  5 20:39:33 2024
  read: IOPS=2200k, BW=8593MiB/s (9010MB/s)(83.9GiB/10002msec)
    slat (nsec): min=820, max=722735, avg=4583.83, stdev=6342.52
    clat (nsec): min=388, max=266657, avg=600.72, stdev=193.08
     lat (nsec): min=1260, max=726053, avg=5184.55, stdev=6374.13
    clat percentiles (nsec):
     |  1.00th=[  478],  5.00th=[  486], 10.00th=[  486], 20.00th=[  490],
     | 30.00th=[  498], 40.00th=[  510], 50.00th=[  596], 60.00th=[  612],
     | 70.00th=[  636], 80.00th=[  708], 90.00th=[  764], 95.00th=[  796],
     | 99.00th=[  956], 99.50th=[ 1048], 99.90th=[ 1736], 99.95th=[ 4048],
     | 99.99th=[ 6048]
   bw (  MiB/s): min= 4919, max= 9612, per=99.94%, avg=8587.20, stdev=31.31, samples=608
   iops        : min=1259344, max=2460780, avg=2198322.53, stdev=8015.10, samples=608
  write: IOPS=550k, BW=2149MiB/s (2254MB/s)(21.0GiB/10002msec); 0 zone resets
    slat (nsec): min=1057, max=4563.9k, avg=33924.39, stdev=19622.92
    clat (nsec): min=373, max=398921, avg=640.85, stdev=277.02
     lat (nsec): min=1549, max=4566.9k, avg=34565.24, stdev=19649.11
    clat percentiles (nsec):
     |  1.00th=[  458],  5.00th=[  462], 10.00th=[  470], 20.00th=[  490],
     | 30.00th=[  516], 40.00th=[  548], 50.00th=[  620], 60.00th=[  668],
     | 70.00th=[  716], 80.00th=[  764], 90.00th=[  836], 95.00th=[  892],
     | 99.00th=[ 1096], 99.50th=[ 1192], 99.90th=[ 2416], 99.95th=[ 4384],
     | 99.99th=[ 6304]
   bw (  MiB/s): min= 1231, max= 2405, per=99.95%, avg=2148.24, stdev= 7.82, samples=608
   iops        : min=315244, max=615808, avg=549948.21, stdev=2002.76, samples=608
  lat (nsec)   : 500=32.56%, 750=52.88%, 1000=13.58%
  lat (usec)   : 2=0.88%, 4=0.04%, 10=0.05%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=7.74%, sys=89.41%, ctx=122598, majf=0, minf=1013
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=22001396,5503573,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=8593MiB/s (9010MB/s), 8593MiB/s-8593MiB/s (9010MB/s-9010MB/s), io=83.9GiB (90.1GB), run=10002-10002msec
  WRITE: bw=2149MiB/s (2254MB/s), 2149MiB/s-2149MiB/s (2254MB/s-2254MB/s), io=21.0GiB (22.5GB), run=10002-10002msec

Disk stats (read/write):
  nvme0n1: ios=102521/10448, sectors=820168/496224, merge=0/39, ticks=8470/2805, in_queue=11275, util=13.29%