examples/c/vm_files/fio_output_hs.log
hotspot: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.36
Starting 32 processes

fio: terminating on signal 2

hotspot: (groupid=0, jobs=32): err= 0: pid=91057: Wed Dec  4 23:50:22 2024
  read: IOPS=836k, BW=3264MiB/s (3423MB/s)(28.0GiB/8771msec)
    slat (nsec): min=826, max=583916, avg=12117.63, stdev=31055.97
    clat (nsec): min=370, max=179055, avg=555.73, stdev=228.57
     lat (nsec): min=1280, max=588238, avg=12673.36, stdev=31126.48
    clat percentiles (nsec):
     |  1.00th=[  422],  5.00th=[  434], 10.00th=[  434], 20.00th=[  438],
     | 30.00th=[  442], 40.00th=[  454], 50.00th=[  540], 60.00th=[  556],
     | 70.00th=[  588], 80.00th=[  660], 90.00th=[  724], 95.00th=[  796],
     | 99.00th=[ 1004], 99.50th=[ 1144], 99.90th=[ 2008], 99.95th=[ 4640],
     | 99.99th=[ 7008]
   bw (  MiB/s): min=  550, max= 7180, per=100.00%, avg=5344.01, stdev=68.42, samples=320
   iops        : min=140818, max=1838332, avg=1368066.80, stdev=17515.14, samples=320
  write: IOPS=209k, BW=816MiB/s (856MB/s)(7158MiB/8771msec); 0 zone resets
    slat (nsec): min=1041, max=5070.4k, avg=33804.31, stdev=31018.75
    clat (nsec): min=383, max=74237, avg=622.05, stdev=236.05
     lat (nsec): min=1594, max=5072.1k, avg=34426.36, stdev=31042.60
    clat percentiles (nsec):
     |  1.00th=[  446],  5.00th=[  458], 10.00th=[  466], 20.00th=[  482],
     | 30.00th=[  510], 40.00th=[  540], 50.00th=[  596], 60.00th=[  636],
     | 70.00th=[  684], 80.00th=[  732], 90.00th=[  812], 95.00th=[  884],
     | 99.00th=[ 1080], 99.50th=[ 1192], 99.90th=[ 2064], 99.95th=[ 5024],
     | 99.99th=[ 7200]
   bw (  MiB/s): min=  138, max= 1796, per=100.00%, avg=1336.15, stdev=17.12, samples=320
   iops        : min=35408, max=459838, avg=342054.80, stdev=4382.12, samples=320
  lat (nsec)   : 500=42.60%, 750=48.28%, 1000=7.96%
  lat (usec)   : 2=1.06%, 4=0.04%, 10=0.06%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.57%, sys=59.53%, ctx=2301113, majf=0, minf=1022
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7329340,1832475,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3264MiB/s (3423MB/s), 3264MiB/s-3264MiB/s (3423MB/s-3423MB/s), io=28.0GiB (30.0GB), run=8771-8771msec
  WRITE: bw=816MiB/s (856MB/s), 816MiB/s-816MiB/s (856MB/s-856MB/s), io=7158MiB (7506MB), run=8771-8771msec

Disk stats (read/write):
  nvme0n1: ios=757068/350871, sectors=6056560/5475944, merge=0/59, ticks=68635/749808, in_queue=818443, util=61.88%